---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ChildrenLostOnGroupSwap
source: html/5558b3bb-c2b7-6686-9eed-053a9bc42eb9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ChildrenLostOnGroupSwap Property

Some elements could not find new hosts after changing group type and will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId ChildrenLostOnGroupSwap { get; }
```